def get_year(date):
    pass


def get_month(date):
    pass


def num_to_big(num):
    dict1 = {1: '壹', 2: '贰', 3: '叁', 4: '肆', 5: '伍', 6: '陆', 7: '柒', 8: '捌', 9: '玖', 0: '零'}
    dict2 = {2: '拾', 3: '佰', 4: '仟', 5: '万', 6: '拾', 7: '佰', 8: '仟', 1: '元', 9: '角', 10: '分', 11: '整'}
    money = ''  # 最终大写数字
    flag = False  # 去掉多余的十百千
    flag2 = False  # 增加零
    ifint = False  # 整
    count = 0
    count2 = 8
    # num = 11324
    strnum = num
    if type(strnum) != str:
        strnum = str(strnum)
    aa = strnum.split('.')
    bb = list(str(aa[:1])[2:-2])
    cc = list(str(aa[1:])[2:-2])
    # 此处控制：无小数时输出xxx元整
    # 若要求一位小数也带整，即xxx元整并且xxx元xx角整，则修改下方0为1
    if len(cc) <= 0:
        ifint = True
    else:
        ifint = False
    # 整数部分
    for i in reversed(bb):
        count = count + 1
        if int(i) == 0:
            if flag == True:
                if count != 5:
                    continue
                else:
                    money = dict2[count] + money
            else:
                if flag2 == False:
                    money = dict2[count] + money
                else:
                    if count != 5:
                        money = '零' + money
                    else:
                        money = dict2[count] + '零' + money
            flag = True
        else:
            flag = False
            flag2 = True
            money = dict1[int(i)] + dict2[count] + money
    # 小数部分
    for i in cc:
        count2 = count2 + 1
        money = money + dict1[int(i)] + dict2[count2]
    if (ifint == True):
        money = money + '整'
    return money


params = {}

data = {
    'p1': params['申报编号'],  # 申报编号
    'p2': params['计划类别'],  # 计划类别
    'p3': params['项目名称'],  # 项目名称
    'p4': params['课题名称'],  # 课题名称
    'p5': params['申报单位'],  # 申报单位
    'p6': params['课题负责人'],  # 课题负责人
    'p7': params['联系电话'],  # 联系电话
    'p8': params['手机'],  # 手机
    'p9': params['电子邮箱'],  # 电子邮箱
    'p10': get_year(params['起止年限']),  # 起止年限年
    'p11': get_month(params['起止年限']),  # 起止年限月
    'p12': get_year(params['起止年限']),  # 起止年限年
    'p13': get_month(params['起止年限']),  # 起止年限月
    'p14': get_year(params['申报日期']),  # 申报日期年
    'p15': get_year(params['申报日期']),  # 申报日期月
    'p16': get_year(params['申报日期']),  # 申报日期日
    'p17': params['课题名称'],  # 课题名称
    'p18': params['产学研联合'],  # 产学研联合
    'p19': params['创新类型'],  # 创新类型
    'p20': params['合作形式'],  # 合作形式
    'p21': params['所处阶段'],  # 所处阶段
    'p22': params['课题总体目标'],  # 课题总体目标
    'p23': params['课题考核指标'],  # 课题考核指标
    'p24': params['单位名称'],  # 单位名称
    'p25': params['统一社会信用代码或组织机构代码'],  # 统一社会信用代码或组织机构代码
    'p26': params['法人代表姓名'],  # 法人代表姓名
    'p27': params['单位地址'],  # 单位地址
    'p28': params['邮编'],  # 邮编
    'p29': params['单位联系人'],  # 单位联系人
    'p30': params['联系电话'],  # 联系电话
    'p31': params['手机'],  # 手机
    'p32': params['传真'],  # 传真
    'p33': params['电子邮箱'],  # 电子邮箱
    'p34': params['单位类别'],  # 单位类别
    'p35': params['项目人员情况成员总数'],  # 材料费开支内容
    'p36': params['项目人员情况技术人员'],  # 材料费备注
    'p37': params['项目人员情况高级职称'],  # 测试化验加工费单位自筹经费
    'p38': params['项目人员情况中级职称'],  # 测试化验加工费科技经费
    'p39': params['单位开户名称'],  # 测试化验加工费开支内容
    'p40': params['开户银行'],  # 测试化验加工费备注
    'p41': params['银行账号'],  # 燃料动力费单位自筹经费
    'p42': params['发明专利'],  # 发明专利
    'p43': params['工业新产品'],  # 工业新产品
    'p44': params['创新/示范基地'],  # 创新/示范基地
    'p45': params['实用新型专利'],  # 实用新型专利
    'p46': params['农业新品种'],  # 农业新品种
    'p47': params['申请登记计算机软件'],  # 申请登记计算机软件
    'p48': params['个数'],  # 个数
    'p49': params['引进技术'],  # 引进技术
    'p50': params['研发平台'],  # 研发平台
    'p51': params['技术交易额'],  # 技术交易额
    'p52': params['集成应用技术'],  # 集成应用技术
    'p53': params['示范点'],  # 示范点
    'p54': params['国际标准'],  # 国际标准
    'p55': params['新技术（工艺、方法、模式）'],  # 新技术（工艺、方法、模式）
    'p56': params['培养博士后'],  # 培养博士后
    'p57': params['国家标准'],  # 国家标准
    'p58': params['新材料'],  # 新材料
    'p59': params['培养博士'],  # 培养博士
    'p60': params['行业标准'],  # 行业标准
    'p61': params['新装置'],  # 新装置
    'p62': params['培养硕士'],  # 培养硕士
    'p63': params['地方标准'],  # 地方标准
    'p64': params['生产线'],  # 生产线
    'p65': params['一般期刊'],  # 一般期刊
    'p66': params['企业标准'],  # 企业标准
    'p67': params['中试线'],  # 中试线
    'p68': params['核心期刊'],  # 核心期刊
    'p69': params['举办培训班'],  # 举办培训班
    'p70': params['科技信息服务平台'],  # 科技信息服务平台
    'p71': params['高水平期刊'],  # 高水平期刊
    'p72': params['参加培训人数'],  # 参加培训人数
    'p73': params['专著'],  # 专著
    'p74': params['学术报告'],  # 学术报告
    'p75': params['新增产值'],  # 新增产值
    'p76': params['新增税收'],  # 新增税收
    'p77': params['出口创汇'],  # 出口创汇
    'p78': params['合计'],  # 合计
    'p79': params['申请科技经费'],  # 申请科技经费
    'p80': params['单位自筹'],  # 单位自筹
    'p81': params['（国家）部门提供经费'],  # （国家）部门提供经费
    'p82': params['（自治区）部门提供经费'],  # （自治区）部门提供经费
    'p83': params['(市级)部门提供经费'],  # (市级)部门提供经费
    'p84': params['其他经费'],  # 其他经费
    'p85': params['直接费用合计'],  # 直接费用合计
    'p86': params['直接费用申请科技经费'],  # 直接费用申请科技经费
    'p87': params['直接费用其余经费'],  # 直接费用其余经费
    'p88': params['直接费用用途说明'],  # 直接费用用途说明
    'p89': params['设备费合计'],  # 设备费合计
    'p90': params['设备费申请科技经费'],  # 设备费申请科技经费
    'p91': params['设备费其余经费'],  # 设备费其余经费
    'p92': params['设备费用途说明'],  # 设备费用途说明
    'p93': params['材料费合计'],  # 材料费合计
    'p94': params['材料费申请科技经费'],  # 材料费申请科技经费
    'p95': params['材料费其余经费'],  # 材料费其余经费
    'p96': params['材料费用途说明'],  # 材料费用途说明
    'p97': params['测试化验加工费合计'],  # 测试化验加工费合计
    'p98': params['测试化验加工费申请科技经费'],  # 测试化验加工费申请科技经费
    'p99': params['测试化验加工费其余经费'],  # 测试化验加工费其余经费
    'p100': params['测试化验加工费用途说明'],  # 测试化验加工费用途说明
    'p101': params['燃料动力费合计'],  # 燃料动力费合计
    'p102': params['燃料动力费申请科技经费'],  # 燃料动力费申请科技经费
    'p103': params['燃料动力费其余经费'],  # 燃料动力费其余经费
    'p104': params['燃料动力费用途说明'],  # 燃料动力费用途说明
    'p105': params['差旅费合计'],  # 差旅费合计
    'p106': params['差旅费申请科技经费'],  # 差旅费申请科技经费
    'p107': params['差旅费其余经费'],  # 差旅费其余经费
    'p108': params['差旅费用途说明'],  # 差旅费用途说明
    'p109': params['会议费合计'],  # 会议费合计
    'p110': params['会议费申请科技经费'],  # 出口会议费申请科技经费创汇
    'p111': params['会议费其余经费'],  # 会议费其余经费
    'p112': params['会议费用途说明'],  # 会议费用途说明
    'p113': params['国际合作与交流费合计'],  # 国际合作与交流费合计
    'p114': params['国际合作与交流费申请科技经费'],  # 国际合作与交流费申请科技经费
    'p115': params['国际合作与交流费其余经费'],  # 国际合作与交流费其余经费
    'p116': params['国际合作与交流费用途说明'],  # 国际合作与交流费用途说明
    'p117': params['出版/文献/信息传播/知识产权事务费合计'],  # 出版/文献/信息传播/知识产权事务费合计
    'p118': params['出版/文献/信息传播/知识产权事务费申请科技经费'],  # 出版/文献/信息传播/知识产权事务费申请科技经费
    'p119': params['出版/文献/信息传播/知识产权事务费其余经费'],  # 出版/文献/信息传播/知识产权事务费其余经费
    'p120': params['出版/文献/信息传播/知识产权事务费用途说明'],  # 出版/文献/信息传播/知识产权事务费用途说明
    'p121': params['劳务费合计'],  # 劳务费合计
    'p122': params['劳务费申请科技经费'],  # 劳务费申请科技经费
    'p123': params['劳务费其余经费'],  # 劳务费其余经费
    'p124': params['劳务费用途说明'],  # 劳务费用途说明
    'p125': params['专家咨询费合计'],  # 专家咨询费合计
    'p126': params['专家咨询费申请科技经费'],  # 专家咨询费申请科技经费
    'p127': params['专家咨询费其余经费'],  # 专家咨询费其余经费
    'p128': params['专家咨询费用途说明'],  # 专家咨询费用途说明
    'p129': params['其他费用合计'],  # 其他费用合计
    'p130': params['其他费用申请科技经费'],  # 其他费用申请科技经费
    'p131': params['其他费用其余经费'],  # 其他费用其余经费
    'p132': params['其他费用用途说明'],  # 其他费用用途说明
    'p133': params['间接费用合计'],  # 间接费用合计
    'p134': params['间接费用申请科技经费'],  # 间接费用申请科技经费
    'p135': params['间接费用其余经费'],  # 间接费用其余经费
    'p136': params['间接费用用途说明'],  # 间接费用用途说明
    'p137': params['合计合计'],  # 合计合计
    'p138': params['合计申请科技经费'],  # 合计申请科技经费
    'p139': params['合计其余经费'],  # 合计其余经费
    'p140': params['合计用途说明'],  # 合计用途说明
    'p141': params['申报单位专利申请总数'],  # 申报单位专利申请总数
    'p142': params['申报单位专利授权总数'],  # 申报单位专利授权总数
    'p143': params['申报单位发明申请'],  # 申报单位发明申请
    'p144': params['申报单位发明授权'],  # 申报单位发明授权
    'p145': params['申报单位实用新型申请'],  # 申报单位实用新型申请
    'p146': params['申报单位实用新型授权'],  # 申报单位实用新型授权
    'p147': params['申报单位软件版权'],  # 申报单位软件版权
    'p148': params['其中近三年专利申请总数'],  # 其中近三年专利申请总数
    'p149': params['其中近三年专利授权总数'],  # 其中近三年专利授权总数
    'p150': params['其中近三年发明申请'],  # 其中近三年发明申请
    'p151': params['其中近三年发明授权'],  # 其中近三年发明授权
    'p152': params['其中近三年实用新型申请'],  # 其中近三年实用新型申请
    'p153': params['其中近三年实用新型授权'],  # 其中近三年实用新型授权
    'p154': params['其中近三年软件版权'],  # 其中近三年软件版权
    'p155': params['专利申请总数申请'],  # 专利申请总数申请
    'p156': params['专利授权总数授权'],  # 专利授权总数
    'p157': params['发明申请'],  # 其中近三年软件版权
    'p158': params['发明授权'],  # 其中近三年软件版权
    'p159': params['实用新型'],  # 其中近三年软件版权
    'p160': params['实用新型'],  # 其中近三年软件版权
    'p161': params['软件版权'],  # 软件版权
    'p162': params['其他知识产权现状说明'],  # 其他知识产权现状说明
    'p163': params['课题负责人序号'],  # 课题负责人序号
    'p164': params['课题负责人姓名'],  # 课题负责人姓名
    'p165': params['课题负责人性别'],  # 课题负责人性别
    'p166': params['课题负责人身份证号码'],  # 课题负责人身份证号码
    'p167': params['课题负责人年龄'],  # 课题负责人年龄
    'p168': params['课题负责人学历'],  # 课题负责人学历
    'p169': params['课题负责人职称'],  # 课题负责人职称
    'p170': params['课题负责人工作单位'],  # 课题负责人工作单位
    'p171': params['课题负责人从事专业'],  # 课题负责人从事专业
    'p172': params['课题负责人课题分工'],  # 课题负责人课题分工
    'p173': params['课题负责人签字'],  # 课题负责人签字
    'p174': params['主要研究开发人员'],  # 主要研究开发人员
    'p175': params['课题负责人近五年内承担各级科技计划项目（课题）完成情况'],  # 课题负责人近五年内承担各级科技计划项目（课题）完成情况
    'p176': params['本申报课题已获得的财政经费等支持情况'],  # 本申报课题已获得的财政经费等支持情况
}
